Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/mbedtls/fsl_sss_mbedtls_apis.c
sss_status_t sss_mbedtls_cipher_init(sss_mbedtls_symmetric_t *context, uint8_t *iv, size_t ivLen)
{
    sss_status_t retval = kStatus_SSS_Fail;
#if SSS_HAVE_TESTCOUNTERPART
    const mbedtls_cipher_info_t *cipher_info = NULL;
    mbedtls_cipher_type_t cipher_type        = MBEDTLS_CIPHER_NONE;
    int ret                                  = -1;
    retval                                   = kStatus_SSS_Success;
    context->cipher_ctx = (mbedtls_cipher_context_t *)SSS_CALLOC(1, sizeof(mbedtls_cipher_context_t));
    ENSURE_OR_GO_EXIT(context->cipher_ctx != NULL);

    if (context->algorithm == kAlgorithm_SSS_AES_ECB) {
        switch (context->keyObject->keyBitLen) {
        case 128:
            cipher_type = MBEDTLS_CIPHER_AES_128_ECB;
            break;
        case 192:
            cipher_type = MBEDTLS_CIPHER_AES_192_ECB;
            break;
        case 256:
            cipher_type = MBEDTLS_CIPHER_AES_256_ECB;
            break;
        default:
            LOG_E("Invalid kAlgorithm_SSS_AES_ECB keyBitLen");
            retval = kStatus_SSS_Fail;
            goto exit;
        }
    }
    else if (context->algorithm == kAlgorithm_SSS_AES_CBC) {
        switch (context->keyObject->keyBitLen) {
        case 128:
            cipher_type = MBEDTLS_CIPHER_AES_128_CBC;
            break;
        case 192:
            cipher_type = MBEDTLS_CIPHER_AES_192_CBC;
            break;
        case 256:
            cipher_type = MBEDTLS_CIPHER_AES_256_CBC;
            break;
        default:
            LOG_E("Invalid kAlgorithm_SSS_AES_CBC keyBitLen");
            retval = kStatus_SSS_Fail;
            goto exit;
        }
    }
    else if (context->algorithm == kAlgorithm_SSS_AES_CTR) {
        switch (context->keyObject->keyBitLen) {
        case 128:
            cipher_type = MBEDTLS_CIPHER_AES_128_CTR;
            break;
        case 192:
            cipher_type = MBEDTLS_CIPHER_AES_192_CTR;
            break;
        case 256:
            cipher_type = MBEDTLS_CIPHER_AES_256_CTR;
            break;
        default:
            LOG_E("Invalid kAlgorithm_SSS_AES_CTR keyBitLen");
            retval = kStatus_SSS_Fail;
            goto exit;
        }
    }
    else if (context->algorithm == kAlgorithm_SSS_DES_ECB) {
        cipher_type = MBEDTLS_CIPHER_DES_ECB;
    }
    else if (context->algorithm == kAlgorithm_SSS_DES3_ECB) {
        cipher_type = MBEDTLS_CIPHER_DES_EDE3_ECB;
    }
    else if (context->algorithm == kAlgorithm_SSS_DES_CBC) {
        cipher_type = MBEDTLS_CIPHER_DES_CBC;
    }
    else if (context->algorithm == kAlgorithm_SSS_DES3_CBC) {
        cipher_type = MBEDTLS_CIPHER_DES_EDE3_CBC;
    }
    else {
        retval = kStatus_SSS_InvalidArgument;
        SSS_FREE(context->cipher_ctx);
        goto exit;
    }

    if (cipher_type != MBEDTLS_CIPHER_NONE) {
        cipher_info = mbedtls_cipher_info_from_type(cipher_type);
    }

    mbedtls_cipher_init(context->cipher_ctx);

    if (0 == mbedtls_cipher_setup(context->cipher_ctx, cipher_info)) {
        if (context->mode == kMode_SSS_Encrypt) {
            if ((context->keyObject->contents_size * 8) > INT_MAX) {
                retval = kStatus_SSS_Fail;
                goto exit;
            }
            if (mbedtls_cipher_setkey(context->cipher_ctx,
                    context->keyObject->contents,
                    context->keyObject->contents_size * 8,
                    MBEDTLS_ENCRYPT) != 0) {
                retval = kStatus_SSS_InvalidArgument;
            }
        }
        else if (context->mode == kMode_SSS_Decrypt) {
            if ((context->keyObject->contents_size * 8) > INT_MAX) {
                retval = kStatus_SSS_Fail;
                goto exit;
            }
            if (mbedtls_cipher_setkey(context->cipher_ctx,
                    context->keyObject->contents,
                    context->keyObject->contents_size * 8,
                    MBEDTLS_DECRYPT) != 0) {
                retval = kStatus_SSS_InvalidArgument;
            }
        }
        else {
            retval = kStatus_SSS_InvalidArgument;
        }
        if (retval == kStatus_SSS_Success) {
            if (ivLen != 0) {
                /* This should be only called when iv is initialized */
                ret = mbedtls_cipher_set_iv(context->cipher_ctx, iv, ivLen);
                if (ret < 0) {
                    SSS_FREE(context->cipher_ctx);
                    retval = kStatus_SSS_Fail;
                    goto exit;
                }
            }
            ret = mbedtls_cipher_reset(context->cipher_ctx);
            if (ret < 0) {
                SSS_FREE(context->cipher_ctx);
                retval = kStatus_SSS_Fail;
                goto exit;
            }
        }
    }

exit:
#endif
    return retval;
}

sss_status_t sss_mbedtls_cipher_update(
    sss_mbedtls_symmetric_t *context, const uint8_t *srcData, size_t srcLen, uint8_t *destData, size_t *destLen)
{
    sss_status_t retval = kStatus_SSS_Fail;
#if SSS_HAVE_TESTCOUNTERPART
    uint8_t inputData[CIPHER_BLOCK_SIZE] = {
        0,
    };
    size_t inputData_len = 0;
    size_t src_offset    = 0;
    size_t output_offset = 0;
    size_t outBuffSize   = 0;
    size_t blockoutLen   = 0;
    int retMbedtlsVal;
    size_t cipherBlockSize = CIPHER_BLOCK_SIZE;

    ENSURE_OR_GO_EXIT(context != NULL);
    ENSURE_OR_GO_EXIT(destLen != NULL);
    ENSURE_OR_GO_EXIT(srcData != NULL);
    outBuffSize = *destLen;

    if (context->algorithm == kAlgorithm_SSS_DES_ECB || context->algorithm == kAlgorithm_SSS_DES_CBC ||
        context->algorithm == kAlgorithm_SSS_DES3_ECB || context->algorithm == kAlgorithm_SSS_DES3_CBC) {
        cipherBlockSize = DES_BLOCK_SIZE;
    }
    ENSURE_OR_GO_EXIT((UINT_MAX - context->cache_data_len) >= srcLen);
    if ((context->cache_data_len + srcLen) < cipherBlockSize) {
        /* Insufficinet data to process . Cache the data */
        memcpy((context->cache_data + context->cache_data_len), srcData, srcLen);
        context->cache_data_len = context->cache_data_len + srcLen;
        *destLen                = 0;
        return kStatus_SSS_Success;
    }
    else {
        /* Concatenate the unprocessed and current input data*/
        memcpy(inputData, context->cache_data, context->cache_data_len);
        inputData_len = context->cache_data_len;
        memcpy((inputData + inputData_len), srcData, (cipherBlockSize - context->cache_data_len));
        inputData_len += (cipherBlockSize - context->cache_data_len);
        src_offset += (cipherBlockSize - context->cache_data_len);
        context->cache_data_len = 0;

