Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/mbedtls/fsl_sss_mbedtls_apis.c
        blockoutLen = outBuffSize;
        ENSURE_OR_GO_EXIT(blockoutLen >= inputData_len);
        retMbedtlsVal = mbedtls_cipher_update(
            context->cipher_ctx, inputData, inputData_len, (destData + output_offset), &blockoutLen);
        ENSURE_OR_GO_EXIT(retMbedtlsVal == 0);

        ENSURE_OR_GO_EXIT(outBuffSize >= blockoutLen);
        outBuffSize -= blockoutLen;
        output_offset += blockoutLen;
        if (srcLen < src_offset) {
            goto exit;
        }
        while (srcLen - src_offset >= cipherBlockSize) {
            memcpy(inputData, (srcData + src_offset), cipherBlockSize);
            ENSURE_OR_GO_EXIT((UINT_MAX - src_offset) >= cipherBlockSize);
            src_offset += cipherBlockSize;

            blockoutLen   = outBuffSize;
            inputData_len = cipherBlockSize;
            ENSURE_OR_GO_EXIT(blockoutLen >= inputData_len);
            retMbedtlsVal = mbedtls_cipher_update(
                context->cipher_ctx, inputData, inputData_len, (destData + output_offset), &blockoutLen);
            ENSURE_OR_GO_EXIT(retMbedtlsVal == 0);
            if (outBuffSize < blockoutLen) {
                goto exit;
            }
            outBuffSize -= blockoutLen;
            ENSURE_OR_GO_EXIT((UINT_MAX - output_offset) >= blockoutLen);
            output_offset += blockoutLen;
        }

        *destLen = output_offset;

        /* Copy unprocessed data to cache */
        if ((srcLen - src_offset) > 0) {
            memcpy(context->cache_data, (srcData + src_offset), (srcLen - src_offset));
            context->cache_data_len = (srcLen - src_offset);
        }
    }

    retval = kStatus_SSS_Success;
exit:
    if (retval == kStatus_SSS_Fail) {
        if (destLen != NULL) {
            *destLen = 0;
        }
    }
#endif
    return retval;
}

sss_status_t sss_mbedtls_cipher_finish(
    sss_mbedtls_symmetric_t *context, const uint8_t *srcData, size_t srcLen, uint8_t *destData, size_t *destLen)
{
    sss_status_t retval = kStatus_SSS_Fail;
#if SSS_HAVE_TESTCOUNTERPART
    uint8_t srcdata_updated[2 * CIPHER_BLOCK_SIZE] = {
        0,
    };
    size_t srcdata_updated_len = 0;
    size_t outBuffSize         = 0;
    size_t blockoutLen         = 0;
    size_t output_offset       = 0;
    int retMbedtlsVal;
    uint8_t temp[16] = {
        0,
    };
    size_t temp_len        = sizeof(temp);
    size_t cipherBlockSize = CIPHER_BLOCK_SIZE;

    ENSURE_OR_GO_EXIT(context);
    ENSURE_OR_GO_EXIT(destLen != NULL);
    outBuffSize = *destLen;

    if (context->algorithm == kAlgorithm_SSS_DES_ECB || context->algorithm == kAlgorithm_SSS_DES_CBC ||
        context->algorithm == kAlgorithm_SSS_DES3_ECB || context->algorithm == kAlgorithm_SSS_DES3_CBC) {
        cipherBlockSize = DES_BLOCK_SIZE;
    }

    if (srcLen > cipherBlockSize) {
        LOG_E("srcLen cannot be grater than %zu bytes. Call update function ", cipherBlockSize);
        *destLen = 0;
        goto exit;
    }

    if (context->cache_data_len != 0) {
        memcpy(srcdata_updated, context->cache_data, context->cache_data_len);
        srcdata_updated_len     = context->cache_data_len;
        context->cache_data_len = 0;
    }
    if (srcLen != 0) {
        ENSURE_OR_GO_EXIT(srcData != NULL);
        memcpy((srcdata_updated + srcdata_updated_len), srcData, srcLen);
        srcdata_updated_len += srcLen;
    }

    /* Align buffer to cipherBlockSize */
    if (srcdata_updated_len > 0 && (srcdata_updated_len % cipherBlockSize != 0)) {
        srcdata_updated_len = srcdata_updated_len + (cipherBlockSize - (srcdata_updated_len % cipherBlockSize));
    }

    if (*destLen < srcdata_updated_len) {
        LOG_E("Output buffer not sufficient");
        goto exit;
    }

    *destLen = 0;

    if (srcdata_updated_len > 0) {
        blockoutLen = outBuffSize;
        ENSURE_OR_GO_EXIT(blockoutLen >= cipherBlockSize);
        retMbedtlsVal = mbedtls_cipher_update(
            context->cipher_ctx, srcdata_updated, cipherBlockSize, (destData + output_offset), &blockoutLen);
        ENSURE_OR_GO_EXIT(retMbedtlsVal == 0);
        *destLen = blockoutLen;
        if (outBuffSize < blockoutLen) {
            goto exit;
        }
        outBuffSize -= blockoutLen;
        ENSURE_OR_GO_EXIT((UINT_MAX - output_offset) >= blockoutLen);
        output_offset += blockoutLen;
    }

    if (srcdata_updated_len > cipherBlockSize) {
        blockoutLen = outBuffSize;
        ENSURE_OR_GO_EXIT(blockoutLen >= cipherBlockSize);
        retMbedtlsVal = mbedtls_cipher_update(context->cipher_ctx,
            srcdata_updated + cipherBlockSize,
            cipherBlockSize,
            destData + output_offset,
            &blockoutLen);
        ENSURE_OR_GO_EXIT(retMbedtlsVal == 0);
        ENSURE_OR_GO_EXIT((UINT_MAX - *destLen) >= blockoutLen);
        *destLen += blockoutLen;
        ENSURE_OR_GO_EXIT(outBuffSize >= blockoutLen);
        outBuffSize -= blockoutLen;
        ENSURE_OR_GO_EXIT((UINT_MAX - output_offset) >= blockoutLen);
        output_offset += blockoutLen;
    }

    /*
    * For decrypt operation, on passing 16 bytes of buffer data to mbedtls_cipher_update, data is cached
    * and in next updated call it is processed.
    * So call another update api with zero dummy data
    */
    if (context->mode == kMode_SSS_Decrypt) {
        blockoutLen = outBuffSize;
        retMbedtlsVal = mbedtls_cipher_update(context->cipher_ctx, temp, temp_len, destData + output_offset, &blockoutLen);
        ENSURE_OR_GO_EXIT(retMbedtlsVal == 0);
        ENSURE_OR_GO_EXIT((UINT_MAX - *destLen) >= blockoutLen);
        *destLen += blockoutLen;
    }
    ENSURE_OR_GO_EXIT(context->cipher_ctx != NULL);
    mbedtls_cipher_finish(context->cipher_ctx, temp, &temp_len);
    mbedtls_cipher_free(context->cipher_ctx);
    memset(context->cipher_ctx, 0, sizeof(*(context->cipher_ctx)));
    SSS_FREE(context->cipher_ctx);

    retval = kStatus_SSS_Success;
exit:
#endif
    return retval;
}

sss_status_t sss_mbedtls_cipher_crypt_ctr(sss_mbedtls_symmetric_t *context,
    const uint8_t *srcData,
    uint8_t *destData,
    size_t size,
    uint8_t *initialCounter,
    uint8_t *lastEncryptedCounter,
    size_t *szLeft)
{
    sss_status_t retval = kStatus_SSS_Fail;
    mbedtls_aes_context ctx;
    int mbedtls_ret;

