Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/mbedtls/fsl_sss_mbedtls_apis.c
            #if SSS_HAVE_MBEDTLS_3_X
            outputLen = *destLen - output_offset;
            ret = mbedtls_gcm_update(
                context->gcm_ctx, inputData, inputData_len, (destData + output_offset), outputLen, &outputLen);
            #else
            ret = mbedtls_gcm_update(context->gcm_ctx, inputData_len, inputData, (destData + output_offset));
            #endif

            ENSURE_OR_GO_CLEANUP(ret == 0);
            blockoutLen = inputData_len;

            ENSURE_OR_GO_CLEANUP(outBuffSize >= blockoutLen);
            outBuffSize -= blockoutLen;
            output_offset += blockoutLen;
            if (srcLen < src_offset) {
                goto cleanup;
            }
            while (srcLen - src_offset >= CIPHER_BLOCK_SIZE) {
                memcpy(inputData, (srcData + src_offset), 16);
                ENSURE_OR_GO_CLEANUP((UINT_MAX - src_offset) >= CIPHER_BLOCK_SIZE);
                src_offset += CIPHER_BLOCK_SIZE;

                blockoutLen = outBuffSize;

                /* Add Source Data */
                if (context->gcm_ctx == NULL) {
                    return kStatus_SSS_Fail;
                }
                #if SSS_HAVE_MBEDTLS_3_X
                ENSURE_OR_GO_CLEANUP(*destLen >= output_offset);
                outputLen = *destLen - output_offset;
                ret = mbedtls_gcm_update(
                    context->gcm_ctx, inputData, inputData_len, (destData + output_offset), outputLen, &outputLen);
                #else
                ret = mbedtls_gcm_update(context->gcm_ctx, inputData_len, inputData, (destData + output_offset));
                #endif
                ENSURE_OR_GO_CLEANUP(ret == 0);
                blockoutLen = inputData_len;
                outBuffSize -= blockoutLen;
                ENSURE_OR_GO_CLEANUP((UINT_MAX - output_offset) >= blockoutLen);
                output_offset += blockoutLen;
            }
            *destLen = output_offset;
            /* Copy unprocessed data to cache */
            memcpy(context->cache_data, (srcData + src_offset), (srcLen - src_offset));
            context->cache_data_len = (srcLen - src_offset);
        }
    }
    retval = kStatus_SSS_Success;
cleanup:
    if (retval == kStatus_SSS_Fail) {
        if (destLen != NULL) {
            *destLen = 0;
        }
    }
#endif /*End of SSS_HAVE_TESTCOUNTERPART*/
    return retval;
}

#if SSS_HAVE_TESTCOUNTERPART
static sss_status_t sss_mbedtls_aead_ccm_update(sss_mbedtls_aead_t *context, const uint8_t *srcData, size_t srcLen)
{
    sss_status_t retval = kStatus_SSS_Fail;

    ENSURE_OR_GO_EXIT((UINT_MAX - context->ccm_dataoffset) >= srcLen);

    if ((context->ccm_dataoffset + srcLen) <= (context->ccm_dataTotalLen)) {
        memcpy(context->pCcm_data + context->ccm_dataoffset, srcData, srcLen);
        ENSURE_OR_GO_EXIT((UINT_MAX - context->ccm_dataoffset) >= srcLen);
        context->ccm_dataoffset = context->ccm_dataoffset + srcLen;
        retval                  = kStatus_SSS_Success;
    }
    else {
        /*Free the allocated memory in init*/
        if (context->pCcm_data != NULL) {
            SSS_FREE(context->pCcm_data);
            context->pCcm_data = NULL;
        }
    }
    if (context->ccm_dataoffset + srcLen < context->ccm_dataoffset || context->ccm_dataoffset + srcLen < srcLen) {
        goto exit;
    }
exit:
    return retval;
}
#endif //#if SSS_HAVE_TESTCOUNTERPART

sss_status_t sss_mbedtls_aead_finish(sss_mbedtls_aead_t *context,
    const uint8_t *srcData,
    size_t srcLen,
    uint8_t *destData,
    size_t *destLen,
    uint8_t *tag,
    size_t *tagLen)
{
    sss_status_t retval = kStatus_SSS_Fail;
#if SSS_HAVE_TESTCOUNTERPART
    size_t stagLen                                 = 0;
    int ret                                        = 1;
    uint8_t srcdata_updated[2 * CIPHER_BLOCK_SIZE] = {
        0,
    };
    size_t srcdata_updated_len = 0;
    uint8_t *pTag              = NULL;
#if SSS_HAVE_MBEDTLS_3_X
    size_t totalDestLen = 0;
    size_t outDestLen = 0;
#endif

    ENSURE_OR_GO_EXIT(context);
    if (srcLen) {
        ENSURE_OR_GO_EXIT(srcData);
    }
    ENSURE_OR_GO_EXIT(destData);
    ENSURE_OR_GO_EXIT(tag);
    ENSURE_OR_GO_EXIT(tagLen);
    stagLen                    = *tagLen;
    if (context->algorithm == kAlgorithm_SSS_AES_CCM) { /* Check if finish has got source data */
        if ((srcData != NULL) && (srcLen > 0)) {
            retval = sss_mbedtls_aead_ccm_update(context, srcData, srcLen);
            ENSURE_OR_GO_EXIT(retval == kStatus_SSS_Success);
        }
        retval = sss_mbedtls_aead_ccm_finish(context, destData, destLen, tag, tagLen);
        ENSURE_OR_GO_EXIT(retval == kStatus_SSS_Success);
    }
    else {
        if (srcLen > CIPHER_BLOCK_SIZE) {
            LOG_E("srcLen cannot be grater than 16 bytes. Call update function ");
            if (destLen != NULL) {
                *destLen = 0;
            }
            goto exit;
        }

        if (context->cache_data_len != 0) {
            memcpy(srcdata_updated, context->cache_data, context->cache_data_len);
            srcdata_updated_len = context->cache_data_len;
        }

        ENSURE_OR_GO_EXIT(srcdata_updated_len <= SIZE_MAX - srcLen);

        if (srcLen != 0) {
            memcpy((srcdata_updated + srcdata_updated_len), srcData, srcLen);
            srcdata_updated_len += srcLen;
        }

        /* Add Source Data */
        if (context->gcm_ctx == NULL) {
            return kStatus_SSS_Fail;
        }

        #if SSS_HAVE_MBEDTLS_3_X
        if (destLen != NULL) {
            totalDestLen = *destLen;
        }
        outDestLen = 0;
        ret        = mbedtls_gcm_update(
            context->gcm_ctx, srcdata_updated, srcdata_updated_len, destData, totalDestLen, &outDestLen);
        totalDestLen = totalDestLen - outDestLen;
        if (destLen != NULL) {
            *destLen = outDestLen;
        }
        #else
        ret = mbedtls_gcm_update(context->gcm_ctx, srcdata_updated_len, srcdata_updated, destData);
        if (destLen != NULL) {
            *destLen = srcdata_updated_len;
        }
        #endif
        ENSURE_OR_GO_EXIT(ret == 0);

        pTag = (uint8_t *)SSS_MALLOC(*tagLen);
        ENSURE_OR_GO_EXIT(pTag);
        memset(pTag, 0, *tagLen);

        /* Get Tag for Enc*/
        #if SSS_HAVE_MBEDTLS_3_X
        outDestLen = 0;
        ret        = mbedtls_gcm_finish(context->gcm_ctx, destData, totalDestLen, &outDestLen, pTag, stagLen);
        if (destLen != NULL) {
            ENSURE_OR_GO_EXIT(*destLen <= SIZE_MAX - outDestLen);
            *destLen += outDestLen;
        }
        #else
        ret = mbedtls_gcm_finish(context->gcm_ctx, pTag, stagLen);
        #endif

        ENSURE_OR_GO_EXIT(ret == 0);
        if (context->mode == kMode_SSS_Encrypt) {
            memcpy(tag, pTag, stagLen);
        }
        else {
            if (0 != memcmp(pTag, tag, stagLen)) {
                goto exit;
            }
        }

