Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/mbedtls/fsl_sss_mbedtls_apis.c
            #if SSS_HAVE_MBEDTLS_3_X
            if (keyBitLen == 256) {
                ret = mbedtls_ecp_group_load(&pEcpPrv->MBEDTLS_PRIVATE(grp), MBEDTLS_ECP_DP_CURVE25519);
            }
            else if (keyBitLen == 448) {
                ret = mbedtls_ecp_group_load(&pEcpPrv->MBEDTLS_PRIVATE(grp), MBEDTLS_ECP_DP_CURVE448);
            }
            #else
            if (keyBitLen == 256) {
                ret = mbedtls_ecp_group_load(&pEcpPrv->grp, MBEDTLS_ECP_DP_CURVE25519);
            }
            else if (keyBitLen == 448) {
                ret = mbedtls_ecp_group_load(&pEcpPrv->grp, MBEDTLS_ECP_DP_CURVE448);
            }
            #endif

            else {
                ret = 1;
            }
            ENSURE_OR_GO_EXIT(ret == 0);

#ifdef MBEDTLS_DO_LITTLE_ENDIAN // Reverse Endianness
            {
                size_t i                   = 0;
                uint16_t publicKeyIndex    = 0;
                size_t publicKeyLen        = 0;
                uint16_t privateKeyIndex   = 0;
                size_t privateKeyLen       = 0;
                uint8_t pubKeyReversed[64] = {
                    0,
                };
                const uint8_t *pPublicKey  = NULL;
                uint8_t prvKeyReversed[64] = {
                    0,
                };
                const uint8_t *pPrivateKey = NULL;

                asn_retval = sss_util_rfc8410_asn1_get_ec_pair_key_index(
                    data, dataLen, &publicKeyIndex, &publicKeyLen, &privateKeyIndex, &privateKeyLen);
                if (asn_retval != kStatus_SSS_Success) {
                    LOG_W("error in sss_util_rfc8410_asn1_get_ec_pair_key_index");
                    goto exit;
                }

                while (i < publicKeyLen) {
                    ENSURE_OR_GO_EXIT((UINT_MAX - publicKeyIndex) >= publicKeyLen);
                    pubKeyReversed[i] = data[publicKeyIndex + publicKeyLen - i - 1];
                    i++;
                }
                pPublicKey = &pubKeyReversed[0];

                i = 0;
                while (i < privateKeyLen) {
                    ENSURE_OR_GO_EXIT((UINT_MAX - publicKeyIndex) >= publicKeyLen);
                    prvKeyReversed[i] = data[privateKeyIndex + privateKeyLen - i - 1];
                    i++;
                }

                /* RFC 7748, Sec 5 Par 5*/
                if (keyBitLen == 256) {
                    prvKeyReversed[privateKeyLen - 1] = prvKeyReversed[privateKeyLen - 1] & 0xF8;
                    prvKeyReversed[0]                 = prvKeyReversed[0] & 0x7F;
                    prvKeyReversed[0]                 = prvKeyReversed[0] | 0x40;
                }
                else {
                    prvKeyReversed[privateKeyLen - 1] = prvKeyReversed[privateKeyLen - 1] & 0xFC;
                    prvKeyReversed[0]                 = prvKeyReversed[0] | 0x80;
                }

                pPrivateKey = &prvKeyReversed[0];

                #if SSS_HAVE_MBEDTLS_3_X
                ret = mbedtls_mpi_read_binary(&pEcpPrv->MBEDTLS_PRIVATE(d), pPrivateKey, privateKeyLen);
                #else
                ret = mbedtls_mpi_read_binary(&pEcpPrv->d, pPrivateKey, privateKeyLen);
                #endif

                ENSURE_OR_GO_EXIT(ret == 0);

                #if SSS_HAVE_MBEDTLS_3_X
                ret = mbedtls_mpi_read_binary(&pEcpPrv->MBEDTLS_PRIVATE(Q).MBEDTLS_PRIVATE(X), pPublicKey, publicKeyLen);
                #else
                ret = mbedtls_mpi_read_binary(&pEcpPrv->Q.X, pPublicKey, publicKeyLen);
                #endif

                ENSURE_OR_GO_EXIT(ret == 0);

                #if SSS_HAVE_MBEDTLS_3_X
                ret = mbedtls_mpi_lset(&pEcpPrv->MBEDTLS_PRIVATE(Q).MBEDTLS_PRIVATE(Z), 1);
                #else
                ret = mbedtls_mpi_lset(&pEcpPrv->Q.Z, 1);
                #endif
                ENSURE_OR_GO_EXIT(ret == 0);

                retval = kStatus_SSS_Success;
            }
#else
            ret = mbedtls_mpi_read_binary(&pEcpPrv->d, data, dataLen);
            ENSURE_OR_GO_EXIT(ret == 0);
            retval = kStatus_SSS_Success;
#endif
        }
        else {
            #if SSS_HAVE_MBEDTLS_3_X
            ret = mbedtls_pk_parse_key(pk, data, dataLen, NULL, 0, NULL, NULL);
            #else
            ret = mbedtls_pk_parse_key(pk, data, dataLen, NULL, 0);
            #endif
            (ret == 0) ? (retval = kStatus_SSS_Success) : (retval = kStatus_SSS_Fail);
        }
    } break;
    case kSSS_KeyPart_Public: {
        // Sizeof base64_format should be limited to sizeof(pem_format) minus BEGIN_PUBLIC and END_PUBLIC
        // SIMW-2696.
        uint8_t base64_format[1996] = {0};
        mbedtls_pk_context *pk      = (mbedtls_pk_context *)keyObject->contents;
        if (keyObject->cipherType == kSSS_CipherType_EC_MONTGOMERY) {
            mbedtls_ecp_keypair *pEcpPub = NULL;

            ret = mbedtls_pk_setup(pk, mbedtls_pk_info_from_type(MBEDTLS_PK_ECKEY));
            ENSURE_OR_GO_EXIT(ret == 0);

            pEcpPub = mbedtls_pk_ec(*pk);
            ENSURE_OR_GO_EXIT(pEcpPub);
            if (keyBitLen == 256) {
                #if SSS_HAVE_MBEDTLS_3_X
                ret = mbedtls_ecp_group_load(&pEcpPub->MBEDTLS_PRIVATE(grp), MBEDTLS_ECP_DP_CURVE25519);
                #else
                ret = mbedtls_ecp_group_load(&pEcpPub->grp, MBEDTLS_ECP_DP_CURVE25519);
                #endif
            }
            else if (keyBitLen == 448) {
                #if SSS_HAVE_MBEDTLS_3_X
                ret = mbedtls_ecp_group_load(&pEcpPub->MBEDTLS_PRIVATE(grp), MBEDTLS_ECP_DP_CURVE448);
                #else
                ret = mbedtls_ecp_group_load(&pEcpPub->grp, MBEDTLS_ECP_DP_CURVE448);
                #endif
            }
            else {
                ret = 1;
            }
            ENSURE_OR_GO_EXIT(ret == 0);

#ifdef MBEDTLS_DO_LITTLE_ENDIAN // Reverse Endianness
            {
                size_t i                   = 0;
                size_t publicKeyIndex      = 0;
                size_t publicKeyLen        = dataLen;
                size_t nByteKey            = 32; // Corresponds to kSE05x_ECCurve_ECC_MONT_DH_25519
                uint8_t pubKeyReversed[64] = {
                    0,
                };
                const uint8_t *pPublicKey = NULL;
// #define TMP_ENDIAN_VERBOSE
#ifdef TMP_ENDIAN_VERBOSE
                printf("Pub Key Before Reverse & header strip:\n");
                ENSURE_OR_GO_EXIT(dataLen >= (publicKeyIndex + publicKeyLen));
                for (size_t z = 0; z < publicKeyLen; z++) {
                    printf("%02X.", data[publicKeyIndex + z]);
                }
                printf("\n");
                printf("keyBitLen = %d\n", (int)keyBitLen);
#endif
                if (keyBitLen == 256) {
                    publicKeyIndex = der_ecc_mont_dh_25519_header_len;
                    ENSURE_OR_GO_EXIT(publicKeyLen >= der_ecc_mont_dh_25519_header_len);
                    publicKeyLen -= der_ecc_mont_dh_25519_header_len;
                }
                else {
                    nByteKey       = 56;
                    publicKeyIndex = der_ecc_mont_dh_448_header_len;
                    publicKeyLen -= der_ecc_mont_dh_448_header_len;
                }
                ENSURE_OR_GO_EXIT((UINT_MAX - publicKeyIndex) >= publicKeyLen);
                ENSURE_OR_GO_EXIT(dataLen >= (publicKeyIndex + publicKeyLen));
                while (i < nByteKey) {
                    ENSURE_OR_GO_EXIT((publicKeyIndex + publicKeyLen) > i);
                    pubKeyReversed[i] = data[publicKeyIndex + publicKeyLen - i - 1];
                    i++;
                }
                pPublicKey = &pubKeyReversed[0];

#ifdef TMP_ENDIAN_VERBOSE
                printf("Pub Key After Reverse:\n");
                for (size_t z = 0; z < publicKeyLen; z++) {
                    printf("%02X.", pPublicKey[z]);
                }
                printf("\n");
#endif
                #if SSS_HAVE_MBEDTLS_3_X
                ret = mbedtls_mpi_read_binary(&pEcpPub->MBEDTLS_PRIVATE(Q).MBEDTLS_PRIVATE(X), pPublicKey, publicKeyLen);
                #else
                ret = mbedtls_mpi_read_binary(&pEcpPub->Q.X, pPublicKey, publicKeyLen);
                #endif
            }
#else
            ret = mbedtls_mpi_read_binary(&pEcpPub->Q.X, data, dataLen);
#endif // Reverse Endianess

            (ret == 0) ? (retval = kStatus_SSS_Success) : (retval = kStatus_SSS_Fail);

